#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_bytes.hcloud_csi_encryption_key[0]: Refreshing state...
data.external.client_prerequisites_check[0]: Reading...
tls_private_key.ssh_key: Refreshing state... [id=991c63b2c026fb6c21bc39ee186c71747ef1924d]
data.talos_image_factory_extensions_versions.this[0]: Reading...
data.hcloud_location.this: Reading...
talos_machine_secrets.this: Refreshing state... [id=machine_secrets]
tls_private_key.state: Refreshing state... [id=72dfd9598c9bdc33d74d7d60142eef987a40a14f]
data.http.current_ipv6[0]: Reading...
data.http.current_ipv4[0]: Reading...
data.hcloud_certificates.state: Reading...
data.external.client_prerequisites_check[0]: Read complete after 0s [id=-]
hcloud_placement_group.control_plane: Refreshing state... [id=1479805]
data.helm_template.metrics_server[0]: Reading...
data.helm_template.hcloud_csi[0]: Reading...
hcloud_placement_group.worker["k8s-worker-pg-1"]: Refreshing state... [id=1479806]
data.http.current_ipv4[0]: Read complete after 0s [id=https://ipv4.icanhazip.com]
hcloud_ssh_key.this: Refreshing state... [id=108316446]
data.http.current_ipv6[0]: Read complete after 0s [id=https://icanhazip.com]
hcloud_network.this[0]: Refreshing state... [id=11987438]
data.talos_image_factory_extensions_versions.this[0]: Read complete after 1s [id=extensions_info]
data.external.talosctl_version_check[0]: Reading...
data.external.talosctl_version_check[0]: Read complete after 0s [id=-]
tls_self_signed_cert.state: Refreshing state... [id=194492260915717363767593975770544489538]
data.helm_template.cilium: Reading...
data.helm_template.metrics_server[0]: Read complete after 1s [id=metrics-server]
talos_image_factory_schematic.this[0]: Refreshing state... [id=ce4c980550dd2ab1b17bbf2b08801c7eb59418eafe8f279833297925d67c7515]
data.talos_image_factory_urls.amd64: Reading...
data.talos_image_factory_urls.amd64: Read complete after 0s
terraform_data.packer_init: Refreshing state... [id=b1b35c09-98ff-7451-127a-3e8a040d16d4]
data.talos_image_factory_urls.arm64: Reading...
data.talos_image_factory_urls.arm64: Read complete after 0s
data.hcloud_images.amd64[0]: Reading...
data.helm_template.hcloud_csi[0]: Read complete after 1s [id=hcloud-csi]
hcloud_firewall.this[0]: Refreshing state... [id=10611099]
data.hcloud_images.amd64[0]: Read complete after 0s [id=bb6bd804dc82ccf5265edf64bfc982bb2a774440]
data.hcloud_location.this: Read complete after 1s [name=nbg1]
terraform_data.amd64_image[0]: Refreshing state... [id=6d16af35-4d69-8af0-3186-ccac336b387f]
data.hcloud_image.amd64[0]: Reading...
data.hcloud_certificates.state: Read complete after 1s [id=75c97d4b786b1458bff8ffca499a26f6e095708c]
hcloud_network_subnet.load_balancer: Refreshing state... [id=11987438-10.0.64.128/25]
hcloud_network_subnet.worker["worker"]: Refreshing state... [id=11987438-10.0.65.0/25]
hcloud_network_subnet.control_plane: Refreshing state... [id=11987438-10.0.64.0/25]
data.hcloud_image.amd64[0]: Read complete after 0s
data.helm_template.hcloud_ccm: Reading...
hcloud_server.control_plane["k8s-control-1"]: Refreshing state... [id=122364017]
hcloud_server.worker["k8s-worker-2"]: Refreshing state... [id=122364018]
hcloud_network_subnet.autoscaler: Refreshing state... [id=11987438-10.0.95.128/25]
hcloud_server.worker["k8s-worker-1"]: Refreshing state... [id=122364016]
data.helm_template.hcloud_ccm: Read complete after 0s [id=hcloud-cloud-controller-manager]
data.talos_client_configuration.this: Reading...
terraform_data.talos_access_data: Refreshing state... [id=6ceee2a5-bc5e-084f-f0b2-e01e4b2fca91]
data.talos_machine_configuration.worker["k8s-worker-2"]: Reading...
data.talos_client_configuration.this: Read complete after 0s [id=k8s]
data.talos_machine_configuration.worker["k8s-worker-1"]: Reading...
data.talos_machine_configuration.worker["k8s-worker-1"]: Read complete after 0s [id=k8s]
data.talos_machine_configuration.worker["k8s-worker-2"]: Read complete after 0s [id=k8s]
data.helm_template.cilium: Read complete after 1s [id=cilium]
data.talos_machine_configuration.control_plane["k8s-control-1"]: Reading...
data.talos_machine_configuration.control_plane["k8s-control-1"]: Read complete after 0s [id=k8s]
terraform_data.upgrade_control_plane: Refreshing state... [id=b63ab922-2ccd-571d-8566-79198c91ae5b]
terraform_data.upgrade_worker: Refreshing state... [id=ba4e6711-b031-bdd0-0f7f-dc5a844916b3]
terraform_data.upgrade_kubernetes: Refreshing state... [id=b9100760-141f-e034-f776-e8c57d5ccf4e]
talos_machine_configuration_apply.control_plane["k8s-control-1"]: Refreshing state... [id=machine_configuration_apply]
terraform_data.create_talosconfig[0]: Refreshing state... [id=bad4dfae-d9a6-3093-7787-e7687e50c5f7]
talos_cluster_kubeconfig.this: Refreshing state... [id=k8s]
talos_machine_configuration_apply.worker["k8s-worker-2"]: Refreshing state... [id=machine_configuration_apply]
talos_machine_configuration_apply.worker["k8s-worker-1"]: Refreshing state... [id=machine_configuration_apply]
terraform_data.create_kubeconfig[0]: Refreshing state... [id=83c39408-50f1-f59f-f851-d90acde3aa8b]
talos_machine_bootstrap.this: Refreshing state... [id=machine_bootstrap]
terraform_data.synchronize_manifests: Refreshing state... [id=3e2092cf-3267-ec5c-6abe-b86cfe988feb]
hcloud_uploaded_certificate.state: Refreshing state... [id=1590817]
aws_s3_bucket.infra_backups: Refreshing state... [id=cereghino-infra-backups]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place (current -> planned)
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.http.kube_api_health[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "kube_api_health" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + insecure             = true
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = (known after apply)

      + retry {
          + attempts     = 60
          + max_delay_ms = 5000
          + min_delay_ms = 5000
        }
    }

  # hcloud_firewall.this[0] will be updated in-place
  ~ resource "hcloud_firewall" "this" {
        id     = "10611099"
        name   = "k8s"
        # (1 unchanged attribute hidden)

      - rule {
          - description     = "Allow Incoming Requests to Kube API" -> null
          - destination_ips = [] -> null
          - direction       = "in" -> null
          - port            = "6443" -> null
          - protocol        = "tcp" -> null
          - source_ips      = [
              - "94.33.13.77/32",
            ] -> null
        }
      - rule {
          - description     = "Allow Incoming Requests to Talos API" -> null
          - destination_ips = [] -> null
          - direction       = "in" -> null
          - port            = "50000" -> null
          - protocol        = "tcp" -> null
          - source_ips      = [
              - "94.33.13.77/32",
            ] -> null
        }
      + rule {
          + description     = "Allow Incoming Requests to Kube API"
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "128.24.161.180/32",
            ]
        }
      + rule {
          + description     = "Allow Incoming Requests to Talos API"
          + destination_ips = []
          + direction       = "in"
          + port            = "50000"
          + protocol        = "tcp"
          + source_ips      = [
              + "128.24.161.180/32",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # talos_machine_configuration_apply.control_plane["k8s-control-1"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "control_plane" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # terraform_data.synchronize_manifests must be replaced
-/+ resource "terraform_data" "synchronize_manifests" {
      ~ id               = "3e2092cf-3267-ec5c-6abe-b86cfe988feb" -> (known after apply)
      ~ triggers_replace = [
          - "71d74fa9bf94e00e4b15cecd40ffb5b3079ac6bd",
          + "d16f4c79a4223ee02cc518c06dfdddf83816c91a",
            "942bb54032972accd6746a8fc3d3f7c5c66b5b75",
        ]
    }

  # terraform_data.talos_access_data will be updated in-place
  ~ resource "terraform_data" "talos_access_data" {
        id     = "6ceee2a5-bc5e-084f-f0b2-e01e4b2fca91"
      ~ input  = {
          ~ kube_api_source     = [
              - "52.150.30.131/32",
              + "128.24.161.180/32",
            ]
          ~ talos_api_source    = [
              - "52.150.30.131/32",
              + "128.24.161.180/32",
            ]
            # (5 unchanged attributes hidden)
        }
      ~ output = {
          - control_plane_nodes = [
              - "10.0.64.1",
            ]
          - endpoints           = [
              - "46.225.238.232",
              - "2a01:4f8:1c1c:34ba::1",
            ]
          - kube_api_source     = [
              - "52.150.30.131/32",
            ]
          - kube_api_url        = "https://46.225.238.232:6443"
          - talos_api_source    = [
              - "52.150.30.131/32",
            ]
          - talos_primary_node  = "10.0.64.1"
          - worker_nodes        = [
              - "10.0.65.1",
              - "10.0.65.2",
            ]
        } -> (known after apply)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ talos_machine_configurations_control_plane = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"
```

</details>